In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import mysql.connector

In [2]:
# File paths
customers_path =r"C:\Users\J\Desktop\GUVI\Project\DataSpark\DataSet\Customers.csv"
products_path =r"C:\Users\J\Desktop\GUVI\Project\DataSpark\DataSet\Products.csv"
sales_path =r"C:\Users\J\Desktop\GUVI\Project\DataSpark\DataSet\Sales.csv"
exchange_rates_path =r"C:\Users\J\Desktop\GUVI\Project\DataSpark\DataSet\Exchange_Rates.csv"
stores_path =r"C:\Users\J\Desktop\GUVI\Project\DataSpark\DataSet\Stores.csv"

# Load datasets
customers = pd.read_csv(customers_path, encoding='latin1')
products = pd.read_csv(products_path, encoding='latin1')
sales = pd.read_csv(sales_path, encoding='latin1')
exchange_rates = pd.read_csv(exchange_rates_path, encoding='latin1')
stores = pd.read_csv(stores_path, encoding='latin1')

In [3]:
#Customers
# Data Cleaning and Transformation
customers['Birthday'] = pd.to_datetime(customers['Birthday'], errors='coerce')
customers['Age'] = pd.to_datetime('today').year - customers['Birthday'].dt.year
customers['Age'] = customers['Age'].fillna(0).astype(int)

In [4]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15256 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  object
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  datetime64[ns]
 10  Age          15266 non-null  int32
dtypes: datetime64[ns](1), int32(1), int64(1), object(8)
memory usage: 1.2+ MB

In [5]:
customers.isnull().sum()

CustomerKey     0
Gender          0
Name            0
City            0
State Code     10
State           0
Zip Code        0
Country         0
Continent       0
Birthday        0
Age             0
dtype: int64

In [6]:
#DROP THE COLUMN
customers.drop({"State Code","Zip Code"},axis=1,inplace=True)

In [7]:
#RENAME THE COLUMN
exchange_rates.rename(columns={"Currency":"Currency Code"},inplace=True)
exchange_rates['Date'] = pd.to_datetime(exchange_rates['Date'], format="%m/%d/%Y",errors='coerce')

In [8]:
exchange_rates.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           11215 non-null  datetime64[ns]
 1   Currency Code  11215 non-null  object
 2   Exchange       11215 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 263.0+ KB

In [9]:
exchange_rates.isnull().sum()

Date             0
Currency Code    0
Exchange         0
dtype: int64

In [10]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   object
 5   Unit Price USD  2517 non-null   object
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: int64(3), object(7)
memory usage: 196.8+ KB

In [11]:
products.isnull().sum()

ProductKey        0
Product Name      0
Brand             0
Color             0
Unit Cost USD     0
Unit Price USD    0
SubcategoryKey    0
Subcategory       0
CategoryKey       0
Category          0
dtype: int64

In [12]:
products["Unit Cost USD"] = products["Unit Cost USD"].str.replace("$","").str.replace(",","")
products["Unit Cost USD"] = products["Unit Cost USD"].astype(float)

products["Unit Price USD"] = products["Unit Price USD"].str.replace("$","").str.replace(",","")
products["Unit Price USD"] = products["Unit Price USD"].astype(float)

In [13]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   float64
 5   Unit Price USD  2517 non-null   float64
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 196.8+ KB

In [14]:
products.drop({"SubcategoryKey"},axis=1,inplace=True)

In [15]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  object
 3   Delivery Date  13165 non-null  object
 4   CustomerKey    62884 non-null  int64
 5   StoreKey       62884 non-null  int64
 6   ProductKey     62884 non-null  int64
 7   Quantity       62884 non-null  int64
 8   Currency Code  62884 non-null  object
dtypes: int64(6), object(3)
memory usage: 4.3+ MB

In [16]:
sales.isnull().sum()

Order Number         0
Line Item            0
Order Date           0
Delivery Date    49719
CustomerKey          0
StoreKey             0
ProductKey           0
Quantity             0
Currency Code        0
dtype: int64

In [17]:
sales['Order Date'] = pd.to_datetime(sales['Order Date'],format="%m/%d/%Y",errors='coerce').dt.date

In [18]:
#FILL THE MISSING VALUES
sales["Delivery Date"] = sales["Delivery Date"].fillna(0)

In [19]:
stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  66 non-null     float64
 4   Open Date      67 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 2.7+ KB

In [20]:
stores.isnull().sum()

StoreKey         0
Country          0
State            0
Square Meters    1
Open Date        0
dtype: int64

In [21]:
stores.fillna(0)

,StoreKey,Country,State,Square Meters,Open Date
0,1,Australia,Australian Capital Territory,595.0,1/1/2008
1,2,Australia,Northern Territory,665.0,1/12/2008
2,3,Australia,South Australia,2000.0,1/7/2012
3,4,Australia,Tasmania,2000.0,1/1/2010
4,5,Australia,Victoria,2000.0,12/9/2015
...,...,...,...,...,...
62,63,United States,Utah,2000.0,3/6/2008
63,64,United States,Washington DC,1330.0,1/1/2010
64,65,United States,West Virginia,1785.0,1/1/2012
65,66,United States,Wyoming,840.0,1/1/2014
66,0,Online,Online,0.0,1/1/2010

In [22]:
stores['Open Date'] = pd.to_datetime(stores['Open Date'],format="%m/%d/%Y",errors='coerce').dt.date

In [23]:
#REPLACING THE NAN VLAUE
stores = stores.replace({np.nan:None})

In [24]:
import pymysql

con= pymysql.connect(
    host="localhost",
    user="root",
    password="Karthick@04",

    )
print(con)

<pymysql.connections.Connection object at 0x000001AD5D0877A0>

In [25]:
mycursor=con.cursor()

In [26]:
mycursor.execute("CREATE DATABASE IF NOT EXISTS DataSpark")

1

In [27]:
mycursor.execute("SHOW DATABASES")
for x in mycursor:
    print(x)

('dataspark',)
('dte38',)
('information_schema',)
('jai',)
('mysql',)
('performance_schema',)
('red_bus_details',)
('sakila',)
('sys',)
('task',)
('task1',)
('test',)
('world',)

In [28]:
mycursor.execute("USE DataSpark")

0

In [29]:
mycursor.execute('''
    CREATE TABLE IF NOT EXISTS Customers (
    CustomerKey INT PRIMARY KEY,
    Gender VARCHAR(10),
    Name VARCHAR(100),
    City VARCHAR(100),
    State VARCHAR(50),
    State_Code VARCHAR(5),
    Zip_Code VARCHAR(10),
    Country VARCHAR(50),
    Continent VARCHAR(50),
    Birthday DATE,
    Age INT
    )
''')
print("Table Created Successfully")

Table Created Successfully

In [30]:
insert_query = '''INSERT INTO Customers (
                     CustomerKey,
                     Gender,
                     Name,
                     City,
                     State,
                     Country,
                     Continent,
                     Birthday,
                     Age
                  ) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s)'''
data = customers.values.tolist()
mycursor.executemany(insert_query, data)
print("Inserted successfully")

Inserted successfully

In [31]:
#EXCHANGE TABLE CREATION
mycursor.execute('''CREATE TABLE IF NOT EXISTS exchange_rates(
                 Date VARCHAR(255),
                 Currency_Code VARCHAR(255),
                 Exchange FLOAT
                 )''')
print("Table Created successfully")

Table Created successfully

In [32]:
#INSERT VALUES INTO EXCHANGE TABLE
insert_query ='''INSERT INTO exchange_rates(
                 Date,
                 Currency_Code,
                 Exchange)
                 VALUES (%s, %s, %s)'''
data=exchange_rates.values.tolist()
mycursor.executemany(insert_query,data)
print("Inserted successfully")

Inserted successfully

In [33]:
# Create Products Table
mycursor.execute('''CREATE TABLE IF NOT EXISTS Products (
    ProductKey INT PRIMARY KEY,
    ProductName VARCHAR(255),
    Brand VARCHAR(50),
    Color VARCHAR(50),
    UnitCostUSD FLOAT,
    UnitPriceUSD FLOAT,
    Subcategory VARCHAR(50),
    CategoryKey INT,
    Category VARCHAR(50)
)''')
print("Table created successfully")

Table created successfully

In [34]:
insert_query = '''INSERT INTO Products(
                     ProductKey,
                     ProductName,
                     Brand,
                     Color,
                     UnitCostUSD,
                     UnitPriceUSD,
                     Subcategory,
                     CategoryKey,
                     Category)
                  VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s)'''

# Replace NaN with None
products = products.where(pd.notnull(products), None)

# Convert DataFrame to list of lists
data = products.values.tolist()

# Execute the insert statement
mycursor.executemany(insert_query, data)
print("Inserted successfully")

Inserted successfully

In [35]:
#CREATE SALES TABLE
mycursor.execute('''CREATE TABLE IF NOT EXISTS sales(
                 Order_Number INT,
                 Line_Item INT,
                 Order_Date VARCHAR(255),
                 Delivery_Date VARCHAR(255),
                 CustomerKey INT,
                 StoreKey INT,
                 Productkey INT,
                 Quantity INT,
                 Currency_Code VARCHAR(255)
                 )''')
print("Table Created successfully")

Table Created successfully

In [36]:
#INSERT VALUES INTO SALES TABLE
insert_query = '''INSERT INTO sales(
                    Order_Number,
                    Line_Item,
                    Order_Date,
                    Delivery_Date,
                    CustomerKey,
                    StoreKey,
                    ProductKey,
                    Quantity,
                    Currency_Code)
                    VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s)'''
data=sales.values.tolist()
mycursor.executemany(insert_query,data)
print("Insert succesfully")

Insert succesfully

In [78]:
#CREATE STORE TABLE
mycursor.execute('''CREATE TABLE IF NOT EXISTS stores(
                 StoresKey INT,
                 Country VARCHAR(255),
                 State VARCHAR(255),
                 Square_Meters FLOAT,
                 Open_Date VARCHAR(255)
                 )''')
print("Table Created successfully")

Table Created successfully

In [80]:
#INSERT VALUES INTO STROE TABLE
insert_query = '''INSERT INTO stores(
                  StoresKey,
                  Country,
                  State,
                  Square_Meters,
                  Open_date)
                  VALUES (%s, %s, %s, %s, %s)'''
stores = stores.where(pd.notnull(stores), None)
data = stores.values.tolist()
mycursor.executemany(insert_query,data)
print("Insert successfully")

Insert successfully